/* 
一、 flutter Android 真机调试必备条件： 
  1 、准备一台 Android 手机 
  2 、手机需要开启调试模式 
  3 、用数据线把手机连上电脑 
  4 、电脑要允许 USB 调试 
  5 、手机对应的 sdk 版本必须安装
  注意：1、关闭电脑上面的手机助手比如： 360手机助手、应用宝等占用adb 端口的软件
        2、关闭HBuilder 之类占用 Adb 端口的软件
        3、数据线一定要可用（可以用 360 手机助手检测）


二、 flutter 虚拟机调试（第三方模拟器夜神）
  必备条件:

  1、淮备模拟器,虚拟机模拟器可以是 Android Studio自带的模拟器,也可以是第三方模拟器。我们推荐使用第三方模拟器。因为第三方模拟器好安装,并且运行速度快

  2、模拟器安装好后需要打开

  3、推荐使用夜神模拟器https://www.yeshen.com 

注意:

  4、关闭电脑上面的手机助手比如:360手机助手、应用宝等占用adb端口的软件
  5、关闭 BUilder之类占用Adb端口的软件
*/